docs/2021/keyboard-kvm-mouse-mute.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2025-01-19 日 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PC自動切替器のマウスミュートとキーボード</title>
<meta name="author" content="clothoid" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">PC自動切替器のマウスミュートとキーボード</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2d539a5">1. 環境</a></li>
<li><a href="#org099327e">2. 問題</a></li>
<li><a href="#orgd488161">3. 対処方法</a></li>
</ul>
</div>
</div>


<div id="outline-container-org2d539a5" class="outline-2">
<h2 id="org2d539a5"><span class="section-number-2">1.</span> 環境</h2>
<div class="outline-text-2" id="text-1">
<p>
リンクはAmazonのアフィです。
</p>

<ul class="org-ul">
<li>Windows 10 20H2</li>
<li>Windows 10 21H1</li>
<li>Ubuntux 20.0.4.1 LTS</li>
<li><a href="http://amzn.to/1SnrjNu">SANWA SUPPLY デュアルリンク DVI 対応 パソコン自動切替器 SW-KVM4HDCN</a></li>
<li><a href="https://amzn.to/3alLKfD">Logicool M235R</a></li>
<li><a href="https://amzn.to/3alLVaN">東プレ Realforce R2SA-JP3-BK-SHK</a></li>
</ul>
</div>
</div>

<div id="outline-container-org099327e" class="outline-2">
<h2 id="org099327e"><span class="section-number-2">2.</span> 問題</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>SW-KVM2HDCN に以下のを指すとマウスが動作しない
<ul class="org-ul">
<li>Logicool M235R のレシーバーユニット</li>
<li>東プレ Realforce R2SA-JP3-BK-SHK <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></li>
</ul></li>
<li>SW-KVM2HDCN にマウスのみ指すとマウスは動作する</li>
<li>SW-KVM2HDCN にキーボードのみを指すとキーボードは動作する</li>
<li>SW-KVM2HDCNのUSBソケットにキーボードを指すとマウスとキーボードの両方が動作するがSW-KVM2HDCNをキーボードから操作できない(仕様なので当然)</li>
</ol>
</div>
</div>

<div id="outline-container-orgd488161" class="outline-2">
<h2 id="orgd488161"><span class="section-number-2">3.</span> 対処方法</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>マウスエミュレーション機能を ON にする <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
<ol class="org-ol">
<li>[NumLock] を押しながら、[-]を押して、[-]だけ離してから、[NumLock]を離す(ピッ)</li>
<li>[m] を押す(ピッピッ)</li>
</ol></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
RealforceはPC自動切り替え器の動作保証外  
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
デフォルトではONだが前に<a href="file:///home/clothoid/mysite/clothoid.github.io/org/2016/pc-changer-mouse-emulation-off.html">こんな記事</a>の問題でOFFにしていた
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2025-01-19 日 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
